valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
/* ------------------ Menu sistemi ------------------ */
static uint8_t current_page = 0;

typedef struct {
    uint16_t x, y, width, height;
    uint16_t color;
    char text[20];
} Button_t;

void ILI9341_DrawButton(Button_t *btn)
{
    // 3D button effect - raised appearance
    // Main button area
    ILI9341_DrawRectangle(btn->x, btn->y, btn->width, btn->height, btn->color);
    
    // Top and left edges (light)
    ILI9341_DrawLine(btn->x, btn->y, btn->x + btn->width - 1, btn->y, ILI9341_COLOR_WHITE);
    ILI9341_DrawLine(btn->x, btn->y, btn->x, btn->y + btn->height - 1, ILI9341_COLOR_WHITE);
    
    // Bottom and right edges (dark)
    ILI9341_DrawLine(btn->x, btn->y + btn->height - 1, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    ILI9341_DrawLine(btn->x + btn->width - 1, btn->y, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    
    // Inner shadow
    ILI9341_DrawRectangle(btn->x + 2, btn->y + 2, btn->width - 4, btn->height - 4, ILI9341_COLOR_BLACK);
}

uint8_t ILI9341_IsButtonPressed(Button_t *btn, uint16_t touch_x, uint16_t touch_y)
{
    return (touch_x >= btn->x && touch_x <= btn->x + btn->width &&
            touch_y >= btn->y && touch_y <= btn->y + btn->height);
}

/* Ana menu səhifəsi */
void ILI9341_ShowMainPage(void)
{
    /* Köhnə əsas menyu silindi. Yeni əsas ekran göstərilir. */
    ILI9341_ShowPressureControlMain();
}

/* Touch test səhifəsi */
void ILI9341_ShowTouchTestPage(void)
{
    /* Pressure sensor calibration UI removed — redirect to new UI */
    Screen_DrawMain();
}

/* Touch debug - silindi */
void ILI9341_DebugTouch(void)
{
    /* Heçnə etmə */
}

/* Touch test - silindi */
void ILI9341_TestTouch(void)
{
    /* Heçnə etmə */
}

/* Settings səhifəsi */
void ILI9341_ShowSettingsPage(void)
{
    /* Köhnə settings səhifəsi silindi. Yeni əsas ekran göstərilir. */
    ILI9341_ShowPressureControlMain();
}

/* Test səhifəsi */
void ILI9341_ShowTestPage(void)
{
    /* Köhnə test səhifəsi silindi. Yeni əsas ekran göstərilir. */
    ILI9341_ShowPressureControlMain();
}

/* Info səhifəsi */
void ILI9341_ShowInfoPage(void)
{
    /* Köhnə info səhifəsi silindi. Yeni əsas ekran göstərilir. */
    ILI9341_ShowPressureControlMain();
}

/* ------------------ Font funksiyaları ------------------ */
void ILI9341_DrawChar(uint16_t x, uint16_t y, char c, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    if (c < 32 || c > 126) return;
    
    const uint8_t *font_data = &font_7x10.data[(c - 32) * 7];
    
    for (uint8_t i = 0; i < 7; i++) {
        uint8_t line = font_data[i];
        for (uint8_t j = 0; j < 10; j++) {
            if (line & (1 << j)) {
                // Pixel çək
                for (uint8_t sx = 0; sx < size; sx++) {
                    for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, color);
                    }
                }
            } else if (bgcolor != color) {
                // Background pixel çək
            for (uint8_t sx = 0; sx < size; sx++) {
                for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, bgcolor);
                    }
                }
            }
        }
    }
}

void ILI9341_DrawString(uint16_t x, uint16_t y, const char *str, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    uint16_t start_x = x;
    while (*str) {
        if (*str == '\n') {
            y += 12 * size; // 10 + 2 space
            x = start_x;
        } else {
            ILI9341_DrawChar(x, y, *str, color, bgcolor, size);
            x += 8 * size; // 7 + 1 space
        }
        str++;
    }
}

/* ------------------ Pressure Control Globals (fixed placement) ------------------ */
static uint8_t pressure_control_page = 0; // 0=main, 1=menu, 7=touch_cal, 8=pressure_cal, 9=pid_tune
static float current_pressure = 0.0f;
static float drv_percent = 0.0f;
static float zme_percent = 0.0f;
static float motor_percent = 0.0f;
static float drv_duty_cycle = 50.0f;
static float zme_duty_cycle = 50.0f;
static float motor_duty_cycle = 50.0f;
static float drv_frequency = 1000.0f;
static float zme_frequency = 1000.0f;
static float motor_frequency = 1000.0f;

/* Pressure sensor calibration variables */
/* Note: These are NOT static so AdvancedPressureControl can access them */
float min_voltage = 0.5f;      /* Minimum voltage (0.5V) */
float max_voltage = 5.24f;     /* Maximum voltage (5.24V) */
float min_pressure = 0.0f;     /* Minimum pressure (0.0 bar) */
float max_pressure = 300.0f;   /* Maximum pressure (300.0 bar) */
uint16_t adc_min = 410;       /* ADC value at minimum pressure (0.5V) */
uint16_t adc_max = 4095;      /* 12-bit ADC max = 4095 */
static uint8_t calibration_mode = 0; /* 0=normal, 1=calibrate min, 2=calibrate max */

/* Ensure we never overwrite valid calibration data with defaults */
static bool ILI9341_IsPressureCalibrationValid(const CalibrationData_t* cal)
{
    if (cal == NULL || !cal->calibrated) return false;
    if (!isfinite(cal->adc_min) || !isfinite(cal->adc_max) ||
        !isfinite(cal->pressure_min) || !isfinite(cal->pressure_max)) return false;
    if (cal->adc_min < 0.0f || cal->adc_min > (float)ADC_MAX) return false;
    if (cal->adc_max <= cal->adc_min || cal->adc_max > (float)ADC_MAX) return false;
    if (cal->pressure_max <= cal->pressure_min) return false;
    return true;
}

/* Precise conversion constants */
// DÜZƏLİŞ: P_PER_COUNT və P_OFFSET silindi - artıq g_calibration strukturundan istifadə edilir
// Bütün təzyiq konversiyaları Advanced sistemin g_calibration strukturundan istifadə edir
static const float BAR_PER_VOLT = 66.3228f; /* bar per volt (display only) */
static const float V_PER_COUNT = 0.00158f;  /* volt per ADC count (display only) */

/* Motor/DRV/ZME conversion constants */
static const float MOTOR_BAR_PER_PERCENT = 3.144f;    /* bar per 1% motor */
static const float MOTOR_PERCENT_PER_BAR = 0.3181f;  /* % per 1 bar motor */
static const float DRV_BAR_PER_PERCENT = 10.48f;     /* bar per 1% DRV (10-40% range) */
static const float DRV_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar DRV */
static const float ZME_BAR_PER_PERCENT = 10.48f;     /* bar per 1% ZME (0-30% range) */
static const float ZME_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar ZME */

/* Pressure limits for ZME control (separate from sensor calibration) */
static float zme_min_pressure = 3.5f;   /* minimum system pressure for ZME (bar) */
static float zme_max_pressure = 200.0f;  /* maximum system pressure for ZME (bar) */
/* zme_frequency is declared earlier in Pressure Control Globals; do not redefine here */

