valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
// Button states
static uint8_t avto_active = 0;  // REMOVED but kept for compatibility
// stop_active - REMOVED (Stop button deleted)

// Auto mode control variables - REMOVED (AutoMode deleted)

/* Helper function to draw a button with text - no borders, white background */
void ILI9341_DrawControlButton(uint16_t x, uint16_t y, uint16_t width, uint16_t height, 
                               uint16_t color, const char* text, uint8_t text_size)
{
    // Draw button background (white by default, or specified color for special states)
    ILI9341_DrawRectangle(x, y, width, height, color);
    
    // No borders - clean white buttons
    
    // Draw text centered - black text on white background
    uint16_t text_x = x + (width - strlen(text) * 8 * text_size) / 2;
    uint16_t text_y = y + (height - 10 * text_size) / 2;
    ILI9341_DrawString(text_x, text_y, text, ILI9341_COLOR_BLACK, color, text_size);
}

/* Pressure gauge implementation deprecated — provide a no-op stub so legacy callers compile. */
void ILI9341_DrawPressureGauge(uint16_t center_x, uint16_t center_y, uint16_t radius, float pressure, float max_pressure)
{
    (void)center_x; (void)center_y; (void)radius; (void)pressure; (void)max_pressure;
    /* intentionally empty to remove old circular gauge from UI */
}
    
void ILI9341_ShowPressureControlPage(void)
{
    /* Old pressure-control page removed — redirect to new UI */
    Screen_DrawMain();
}
 

/* Menu page */
void ILI9341_ShowMenuPage(void)
{
    /* Köhnə menyu silindi. Yeni əsas ekran göstərilir. */
    ILI9341_ShowPressureControlMain();
}

/* REMOVED: PWM control page - PWM bölməsi silindi
void ILI9341_ShowPWMPage(void)
{
    pressure_control_page = 2;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(120, 20, "PWM CONTROL", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // DRV button
    ILI9341_DrawControlButton(80, 70, 160, 35, ILI9341_COLOR_WHITE, "DRV", 2);
    
    // ZME button
    ILI9341_DrawControlButton(80, 115, 160, 35, ILI9341_COLOR_WHITE, "ZME", 2);
    
    // Motor button
    ILI9341_DrawControlButton(80, 160, 160, 35, ILI9341_COLOR_WHITE, "MOTOR", 2);
    
    // Back button - moved to upper left
    ILI9341_DrawControlButton(20, 20, 80, 25, ILI9341_COLOR_WHITE, "Back", 1);
}
*/

/* REMOVED: Pressure limit page - PRES LIM bölməsi silindi
void ILI9341_ShowPressureLimitPage(void)
{
    pressure_control_page = 3;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(100, 20, "PRES LIM", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // Current target pressure display (from Advanced system)
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    char limit_str[30];
    sprintf(limit_str, "SP: %.1f BAR", status->target_pressure);
    ILI9341_DrawString(80, 80, limit_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 3);
    
    // Range display
    ILI9341_DrawString(100, 120, "0 - 300 BAR", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 2);
    
    // Auto mode status on pressure limit page - REMOVED (AutoMode deleted)
    
    // Control buttons
    ILI9341_DrawControlButton(50, 160, 50, 40, ILI9341_COLOR_WHITE, "-10", 2);
    ILI9341_DrawControlButton(110, 160, 50, 40, ILI9341_COLOR_WHITE, "-1", 2);
    ILI9341_DrawControlButton(170, 160, 50, 40, ILI9341_COLOR_WHITE, "+1", 2);
    ILI9341_DrawControlButton(230, 160, 50, 40, ILI9341_COLOR_WHITE, "+10", 2);
    
    // Back button - moved down a bit from upper left
    ILI9341_DrawControlButton(20, 50, 80, 30, ILI9341_COLOR_WHITE, "Back", 1);
}
*/

/* REMOVED: DRV PWM control page - PWM bölməsi silindi
void ILI9341_ShowDRVPWMPage(void)
{
    pressure_control_page = 4;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(120, 20, "DRV PWM", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(20, 45, "NO Valve: 0%=Open, 100%=Closed", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    // Duty Cycle section
    ILI9341_DrawString(50, 60, "Duty Cycle", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char duty_str[20];
    sprintf(duty_str, "%.1f%%", drv_duty_cycle);
    ILI9341_DrawString(100, 85, duty_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 110, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 110, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Frequency section
    ILI9341_DrawString(50, 150, "Frequency", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char freq_str[20];
    sprintf(freq_str, "%.0f Hz", drv_frequency);
    ILI9341_DrawString(100, 175, freq_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 190, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 190, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Back button - moved to upper left
    ILI9341_DrawControlButton(20, 20, 80, 25, ILI9341_COLOR_WHITE, "Back", 1);
}
*/

/* REMOVED: ZME PWM control page - PWM bölməsi silindi
void ILI9341_ShowZMEPWMPage(void)
{
    pressure_control_page = 5;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(120, 20, "ZME PWM", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(20, 45, "NO Valve: 0%=Open, 100%=Closed", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    // Duty Cycle section
    ILI9341_DrawString(50, 60, "Duty Cycle", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char duty_str[20];
    sprintf(duty_str, "%.1f%%", zme_duty_cycle);
    ILI9341_DrawString(100, 85, duty_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 110, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 110, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Frequency section
    ILI9341_DrawString(50, 150, "Frequency", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char freq_str[20];
    sprintf(freq_str, "%.0f Hz", zme_frequency);
    ILI9341_DrawString(100, 175, freq_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 190, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 190, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Back button - moved to upper left
    ILI9341_DrawControlButton(20, 20, 80, 25, ILI9341_COLOR_WHITE, "Back", 1);
}
*/

/* REMOVED: Motor PWM control page - PWM bölməsi silindi
void ILI9341_ShowMotorPWMPage(void)
{
    pressure_control_page = 6;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(120, 20, "MOTOR PWM", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
