valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    char info[40];
    sprintf(info, "P: %.1f BAR", current_pressure_val);
    ILI9341_DrawString(20, 45, info, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    sprintf(info, "SP: %.1f BAR", status->target_pressure);
    ILI9341_DrawString(150, 45, info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    // SP +/- controls - DÜZƏLİŞ: 10-10 dəyişir, düymələr daha böyük və "-10"/"+10" göstərir
    ILI9341_DrawControlButton(260, 40, 30, 30, ILI9341_COLOR_WHITE, "-10", 1);  // DÜZƏLİŞ: "-10" göstərir və daha böyük
    ILI9341_DrawControlButton(295, 40, 30, 30, ILI9341_COLOR_WHITE, "+10", 1);  // DÜZƏLİŞ: "+10" göstərir və daha böyük
    
    // Read current PID from AdvancedPressureControl system
    float kp = g_pid_zme.Kp;
    float ki = g_pid_zme.Ki;
    float kd = g_pid_zme.Kd;
    
    // Kp row
    ILI9341_DrawString(20, 80, "Kp:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    char val[24];
    // DÜZƏLİŞ: Standart format - Kp üçün 2 onluq yer (0.00 formatı)
    sprintf(val, "%.2f", kp);
    ILI9341_DrawString(80, 80, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 75, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 75, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Ki row
    ILI9341_DrawString(20, 120, "Ki:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    // DÜZƏLİŞ: Standart format - Ki üçün 4 onluq yer (0.0000 formatı)
    sprintf(val, "%.4f", ki);
    ILI9341_DrawString(80, 120, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 115, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 115, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Kd row
    ILI9341_DrawString(20, 160, "Kd:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    // DÜZƏLİŞ: Standart format - Kd üçün 3 onluq yer (0.000 formatı)
    sprintf(val, "%.3f", kd);
    ILI9341_DrawString(80, 160, val, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(190, 155, 45, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(245, 155, 45, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Info: ZME and DRV use same PID parameters
    ILI9341_DrawString(20, 185, "ZME & DRV: Same PID", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Back and Save
    ILI9341_DrawControlButton(20, 200, 80, 30, ILI9341_COLOR_WHITE, "Back", 1);
    ILI9341_DrawControlButton(220, 200, 80, 30, ILI9341_COLOR_WHITE, "Save", 1);
}

/* Update pressure display */
void ILI9341_UpdatePressureDisplay(float pressure)
{
    current_pressure = pressure;
    
    if (pressure_control_page == 0) {
        /* Clean pressure display - no debug clutter */
        
        /* Update pressure value with clean formatting */
        char pressure_str[25];
        if (current_pressure < 10.0) {
            sprintf(pressure_str, "%.2f BAR", current_pressure);
        } else if (current_pressure < 100.0) {
            sprintf(pressure_str, "%.1f BAR", current_pressure);
        } else {
            sprintf(pressure_str, "%.0f BAR", current_pressure);
        }
        
        /* Clear the old text area and draw new text */
        ILI9341_DrawRectangle(130, 125, 100, 20, ILI9341_COLOR_BLACK);
        ILI9341_DrawString(130, 125, pressure_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
        
        /* Update safety status (based on target pressure) */
        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
        ILI9341_DrawRectangle(200, 140, 100, 15, ILI9341_COLOR_BLACK);
        if (current_pressure > (status->target_pressure + 10.0f)) {
            ILI9341_DrawString(200, 140, "OVER LIMIT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        } else if (current_pressure > status->target_pressure) {
            ILI9341_DrawString(200, 140, "NEAR LIMIT", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        } else {
            ILI9341_DrawString(200, 140, "SAFE", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
        }
        
        /* Update the pressure gauge arc only (not the entire circle) */
        ILI9341_DrawPressureGauge(160, 80, 35, current_pressure, 300.0);
    }
}

/* Update percentage displays */
void ILI9341_UpdatePercentageDisplays(float drv_percent_val, float zme_percent_val, float motor_percent_val)
{
    drv_percent = drv_percent_val;
    zme_percent = zme_percent_val;
    motor_percent = motor_percent_val;
    
    if (pressure_control_page == 0) {
        char drv_str[20], zme_str[20], motor_str[20];
        
        // Clear old text area first
        ILI9341_DrawRectangle(10, 210, 80, 15, ILI9341_COLOR_BLACK);
        ILI9341_DrawRectangle(110, 210, 80, 15, ILI9341_COLOR_BLACK);
        ILI9341_DrawRectangle(210, 210, 80, 15, ILI9341_COLOR_BLACK);
        
        sprintf(drv_str, "DRV: %.2f%%", drv_percent);
        sprintf(zme_str, "ZME: %.2f%%", zme_percent);
        sprintf(motor_str, "M: %.1f%%", motor_percent);
        
        ILI9341_DrawString(10, 210, drv_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(110, 210, zme_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(210, 210, motor_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    }
}

/* Show the main Pressure Control screen (page 0) */
void ILI9341_ShowPressureControlMain(void)
{
    /* Redirect legacy ILI9341 pressure-control main to the new UI in main.c */
    Screen_DrawMain();
}


/* Handle touch for pressure control system */
void ILI9341_HandlePressureControlTouch(void)
{
    uint16_t raw_x, raw_y, screen_x, screen_y;
    
    if (XPT2046_IsTouched()) {
        if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
            XPT2046_ConvertToScreen(raw_x, raw_y, &screen_x, &screen_y);
            
            /* Clean touch handling - no debug clutter */
            
            /* Clean interface - no debug clutter */
            
            switch (pressure_control_page) {
                case 0: // Main page
                    /* Menu button removed from legacy UI — no action here */
                    break;
                    
                case 1: // Menu page
                    // REMOVED: PWM button - PWM bölməsi silindi
                    // REMOVED: Pressure Limit button - PRES LIM bölməsi silindi
                    
