valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                    // Pressure Sensor Calibration button (80-240 x, 90-125 y)
                    if (screen_x >= 80 && screen_x <= 240 && screen_y >= 90 && screen_y <= 125) {
                        ILI9341_ShowPressureCalibrationPage();
                    }
                    // PID Tuning button (80-240 x, 135-170 y)
                    else if (screen_x >= 80 && screen_x <= 240 && screen_y >= 135 && screen_y <= 170) {
                        ILI9341_ShowPIDTuningPage();
                    }
                    /* Back button - moved to upper left */
                    else if (screen_x >= 20 && screen_x <= 80 && screen_y >= 20 && screen_y <= 50) {
                        ILI9341_ShowPressureControlMain();
                    }
                    break;
                    
                // REMOVED: case 2 (PWM page), case 4 (DRV PWM page), case 5 (ZME PWM page), case 6 (Motor PWM page)
                // PWM bölməsi tamamilə silindi
                // REMOVED: case 3 (Pressure limit page) - PRES LIM bölməsi silindi
                    
                case 7: // Touch Calibration page
                    // DÜZƏLİŞ: Mode düymələri silinib, yalnız Mode 1 istifadə olunur
                    // Back button
                    if (screen_x >= 20 && screen_x <= 100 && screen_y >= 200 && screen_y <= 230) {
                        ILI9341_ShowMenuPage();
                    }
                    break;
                    
                case 8: // Pressure Sensor Calibration page
                    /* Clean touch handling - no debug clutter */
                    
                    /* CAL MIN button - larger button */
                    /* DÜZƏLİŞ: y koordinatı 190-230 → 200-240 (buton y=200-də çəkilir, hündürlük=40) */
                    if (screen_x >= 20 && screen_x <= 110 && screen_y >= 200 && screen_y <= 240) {
                        /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
                        /* PID sistemi hər 10ms-də bir ADC oxuyur və Status strukturuna yazır */
                        SystemStatus_t* cal_status = AdvancedPressureControl_GetStatus();
                        uint16_t adc_value = cal_status->raw_adc_value;  // Xam ADC dəyəri Status-dan
                        adc_min = adc_value;  /* Set as minimum ADC value */
                        min_pressure = 0.0f; /* DÜZƏLİŞ: Set pressure to 0.0 bar (sıfır təzyiq) */
                        calibration_mode = 0; /* Reset calibration mode */
                        
                        /* Show confirmation */
                        ILI9341_DrawString(20, 200, "MIN CALIBRATED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
                        
                        /* DÜZƏLİŞ: Kalibrləmə dəyərlərini dərhal Advanced sistemə ötür */
                        extern CalibrationData_t g_calibration;
                        g_calibration.adc_min = (float)adc_min;
                        g_calibration.pressure_min = min_pressure;  // 0.0 bar
                            
                            // Recalculate slope and offset immediately if both min and max are set
                            if (adc_max > adc_min) {
                                g_calibration.slope = (max_pressure - min_pressure) / (float)(adc_max - adc_min);
                                g_calibration.offset = min_pressure - (g_calibration.slope * (float)adc_min);
                                printf("MIN Calibration updated - ADC: %d, Pressure: %.2f bar, Slope: %.6f, Offset: %.2f\r\n",
                                       adc_min, min_pressure, g_calibration.slope, g_calibration.offset);
                            }
                        /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
                        ILI9341_ShowPressureCalibrationPage(); /* Refresh page */
                    }
                    /* CAL MAX button - larger button */
                    /* DÜZƏLİŞ: y koordinatı 190-230 → 200-240 (buton y=200-də çəkilir, hündürlük=40) */
                    else if (screen_x >= 120 && screen_x <= 210 && screen_y >= 200 && screen_y <= 240) {
                        /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
                        /* PID sistemi hər 10ms-də bir ADC oxuyur və Status strukturuna yazır */
                        SystemStatus_t* cal_status = AdvancedPressureControl_GetStatus();
                        uint16_t adc_value = cal_status->raw_adc_value;  // Xam ADC dəyəri Status-dan
                        adc_max = adc_value;  /* Set as maximum ADC value */
                        max_pressure = 300.0f; /* Set pressure to 300.0 bar (full range) - DÜZƏLİŞ: float literal */
                        calibration_mode = 0; /* Reset calibration mode */
                        
                        /* Show confirmation */
                        ILI9341_DrawString(110, 200, "MAX CALIBRATED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
                        
                        /* DÜZƏLİŞ: Kalibrləmə dəyərlərini dərhal Advanced sistemə ötür */
                        extern CalibrationData_t g_calibration;
                            g_calibration.adc_max = (float)adc_max;
                            g_calibration.pressure_max = max_pressure;
                            
                            // Recalculate slope and offset immediately
                            if (adc_max > adc_min) {
                                g_calibration.slope = (max_pressure - min_pressure) / (float)(adc_max - adc_min);
                                g_calibration.offset = min_pressure - (g_calibration.slope * (float)adc_min);
                                printf("MAX Calibration updated - ADC: %d, Pressure: %.2f bar, Slope: %.6f, Offset: %.2f\r\n",
                                       adc_max, max_pressure, g_calibration.slope, g_calibration.offset);
                            }
                        /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
                        /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
                        ILI9341_ShowPressureCalibrationPage(); /* Refresh page */
                    }
                    /* SAVE button - larger button */
                    /* DÜZƏLİŞ: y koordinatı 190-230 → 200-240 (buton y=200-də çəkilir, hündürlük=40) */
                    else if (screen_x >= 220 && screen_x <= 310 && screen_y >= 200 && screen_y <= 240) {
                        /* DÜZƏLİŞ: Advanced sistem kalibrləmə funksiyasını istifadə et */
                        // UI-dan kalibrləmə dəyərlərini Advanced sistemə ötür
                        extern uint16_t adc_min, adc_max;
                        extern float min_pressure, max_pressure;
                        
