valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
void ILI9341_HandleCalibrationTouch(void)
{
    /* Handle calibration touch events */
    if (pressure_control_page == 8) {
        /* Update ADC reading display */
        static uint32_t last_adc_update = 0;
        uint32_t current_time = HAL_GetTick();
        
        if (current_time - last_adc_update > 200) { /* Update every 200ms for better responsiveness */
            last_adc_update = current_time;
            
            /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            uint16_t adc_value = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
            
            /* Update display with current ADC value */
            char adc_str[30];
            sprintf(adc_str, "ADC: %d", adc_value);
            ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
            
            /* PID sistemindən təzyiq dəyərini götür */
            float current_pressure = status->current_pressure;
            char pressure_str[30];
            sprintf(pressure_str, "Pressure: %.1f bar", current_pressure);
            ILI9341_DrawString(20, 180, pressure_str, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
            
            /* Show calibration values */
            char debug_cal_str[50];
            sprintf(debug_cal_str, "Cal: %d-%d -> %.1f-%.1f", adc_min, adc_max, min_pressure, max_pressure);
            ILI9341_DrawString(20, 190, debug_cal_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
            /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
            /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
        }
    }
}

/* ==================== AUTO MODE CONTROL FUNCTIONS ==================== */

/* AutoMode functions - REMOVED (AutoMode deleted) */

/* ==================== 3-NÖQTƏLİ TOUCH KALİBRASİYA ==================== */

/**
 * @brief Kalibrasiya nişanı (hədəf) çək
 * @param x, y: Nişanın mərkəzi
 * @param color: Nişanın rəngi
 */
void ILI9341_DrawCalibrationTarget(uint16_t x, uint16_t y, uint16_t color)
{
    /* Böyük + işarəsi çək */
    ILI9341_DrawHLine(x - 15, y, 31, color);      /* Horizontal xətt */
    ILI9341_DrawVLine(x, y - 15, 31, color);      /* Vertical xətt */
    
    /* Mərkəzdə kiçik dairə */
    for (int dx = -3; dx <= 3; dx++) {
        for (int dy = -3; dy <= 3; dy++) {
            if (dx*dx + dy*dy <= 9) {
                ILI9341_DrawPixel(x + dx, y + dy, color);
            }
        }
    }
    
    /* Xarici dairə */
    for (int angle = 0; angle < 360; angle += 10) {
        float rad = angle * 3.14159f / 180.0f;
        int px = x + (int)(12.0f * cosf(rad));
        int py = y + (int)(12.0f * sinf(rad));
        ILI9341_DrawPixel(px, py, color);
    }
}

/**
 * @brief 4-NÖQTƏLİ touch kalibrasiya - BÜTÜN KÜNCLƏR
 * @note Sol-üst, sağ-üst, sol-alt, sağ-alt - 4 küncdə kalibrasiya
 * @return 1 uğurlu, 0 xəta
 */
uint8_t ILI9341_RunTouchCalibration(void)
{
    printf("=== 4-POINT TOUCH CALIBRATION ===\r\n");
    
    /* Kalibrasiya nöqtələri - ekranın 4 küncü */
    /* Ekran: 320x240 (landscape) */
    /* Künc nöqtələri - kənardan 20 piksel içəridə */
    const uint16_t cal_screen_x[4] = {20, 300, 20, 300};   /* Sol-üst, Sağ-üst, Sol-alt, Sağ-alt */
    const uint16_t cal_screen_y[4] = {20, 20, 220, 220};
    const char* cal_labels[4] = {"TOP-LEFT", "TOP-RIGHT", "BOTTOM-LEFT", "BOTTOM-RIGHT"};
    
    uint16_t cal_raw_x[4] = {0, 0, 0, 0};
    uint16_t cal_raw_y[4] = {0, 0, 0, 0};
    uint8_t cal_success = 1;
    
    /* Hər nöqtə üçün kalibrasiya */
    for (int point = 0; point < 4; point++) {
        ILI9341_FillScreen(ILI9341_COLOR_BLACK);
        
        /* Başlıq */
        ILI9341_DrawString(40, 100, "Touch the RED dot", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
        
        char info[32];
        sprintf(info, "Point %d/4: %s", point + 1, cal_labels[point]);
        ILI9341_DrawString(60, 130, info, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        
        /* Hədəf nöqtəni çək - böyük və görünən */
        ILI9341_DrawCalibrationTarget(cal_screen_x[point], cal_screen_y[point], ILI9341_COLOR_RED);
        
        /* Əlavə: kənardan xətt çək ki, künc görünsün */
        if (point == 0) { /* Sol-üst */
            ILI9341_DrawLine(0, cal_screen_y[point], cal_screen_x[point] - 15, cal_screen_y[point], ILI9341_COLOR_YELLOW);
            ILI9341_DrawLine(cal_screen_x[point], 0, cal_screen_x[point], cal_screen_y[point] - 15, ILI9341_COLOR_YELLOW);
        } else if (point == 1) { /* Sağ-üst */
            ILI9341_DrawLine(cal_screen_x[point] + 15, cal_screen_y[point], 319, cal_screen_y[point], ILI9341_COLOR_YELLOW);
            ILI9341_DrawLine(cal_screen_x[point], 0, cal_screen_x[point], cal_screen_y[point] - 15, ILI9341_COLOR_YELLOW);
        } else if (point == 2) { /* Sol-alt */
            ILI9341_DrawLine(0, cal_screen_y[point], cal_screen_x[point] - 15, cal_screen_y[point], ILI9341_COLOR_YELLOW);
            ILI9341_DrawLine(cal_screen_x[point], cal_screen_y[point] + 15, cal_screen_x[point], 239, ILI9341_COLOR_YELLOW);
        } else { /* Sağ-alt */
            ILI9341_DrawLine(cal_screen_x[point] + 15, cal_screen_y[point], 319, cal_screen_y[point], ILI9341_COLOR_YELLOW);
            ILI9341_DrawLine(cal_screen_x[point], cal_screen_y[point] + 15, cal_screen_x[point], 239, ILI9341_COLOR_YELLOW);
        }
        
        /* Touch gözlə - 15 saniyə timeout */
        uint32_t timeout = HAL_GetTick() + 15000;
        uint8_t got_touch = 0;
        uint16_t raw_x = 0, raw_y = 0;
        
        /* Touch buraxılmasını gözlə */
        while (XPT2046_IsTouched() && HAL_GetTick() < timeout) {
            HAL_Delay(10);
        }
        HAL_Delay(300);  /* Əlavə gecikmə - nöqtələr arası */
        
        while (!got_touch && HAL_GetTick() < timeout) {
            if (XPT2046_IsTouched()) {
                HAL_Delay(50);  /* Debounce */
                if (XPT2046_IsTouched()) {
                    /* 8 dəfə oxu və orta dəyəri götür */
                    uint32_t sum_x = 0, sum_y = 0;
                    uint8_t valid_reads = 0;
                    
