valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                    for (int r = 0; r < 8; r++) {
                        uint16_t rx, ry;
                        if (XPT2046_GetCoordinates(&rx, &ry)) {
                            sum_x += rx;
                            sum_y += ry;
                            valid_reads++;
                        }
                        HAL_Delay(15);
                    }
                    
                    if (valid_reads >= 4) {
                        raw_x = sum_x / valid_reads;
                        raw_y = sum_y / valid_reads;
                        got_touch = 1;
                        
                        cal_raw_x[point] = raw_x;
                        cal_raw_y[point] = raw_y;
                        
                        printf("Point %d [%s]: screen(%d,%d) -> raw(%d,%d)\r\n", 
                               point + 1, cal_labels[point], 
                               cal_screen_x[point], cal_screen_y[point], raw_x, raw_y);
                        
                        /* OK göstər */
                        ILI9341_DrawString(140, 160, "OK!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
                        HAL_Delay(400);
                    }
                }
            }
            HAL_Delay(20);
        }
        
        if (!got_touch) {
            printf("Point %d: TIMEOUT - no touch\r\n", point + 1);
            cal_success = 0;
            break;
        }
        
        /* Touch buraxılmasını gözlə */
        while (XPT2046_IsTouched()) {
            HAL_Delay(10);
        }
        HAL_Delay(200);
    }
    
    /* Nəticə ekranı */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    if (cal_success) {
        printf("\n=== 4-POINT CALIBRATION CALCULATION ===\r\n");
        printf("Raw values from 4 corners:\r\n");
        for (int i = 0; i < 4; i++) {
            printf("  P%d [%s]: raw(%d, %d)\r\n", i+1, cal_labels[i], cal_raw_x[i], cal_raw_y[i]);
        }
        
        /* ============================================
         * 4 küncdən X və Y diapazonunu dəqiq hesabla
         * 
         * Ekran koordinatları:
         *   P1(20,20)   P2(300,20)
         *   P3(20,220)  P4(300,220)
         * 
         * Raw koordinatlardan min/max tapırıq
         * ============================================ */
        
        /* Raw dəyərlərin min/max-ını tap */
        uint16_t raw_x_min = cal_raw_x[0], raw_x_max = cal_raw_x[0];
        uint16_t raw_y_min = cal_raw_y[0], raw_y_max = cal_raw_y[0];
        
        for (int i = 1; i < 4; i++) {
            if (cal_raw_x[i] < raw_x_min) raw_x_min = cal_raw_x[i];
            if (cal_raw_x[i] > raw_x_max) raw_x_max = cal_raw_x[i];
            if (cal_raw_y[i] < raw_y_min) raw_y_min = cal_raw_y[i];
            if (cal_raw_y[i] > raw_y_max) raw_y_max = cal_raw_y[i];
        }
        
        printf("Raw ranges: X[%d-%d], Y[%d-%d]\r\n", raw_x_min, raw_x_max, raw_y_min, raw_y_max);
        
        /* ============================================
         * Koordinat MODE-u müəyyən et
         * 4 nöqtədən istifadə edərək ən yaxşı modu tapırıq
         * ============================================ */
        
        /* Kənar məsafələri hesabla - ekran 20 pikseldən başlayır */
        /* 20 piksel = ekranın 6.25%-i (20/320) */
        /* Deməli raw aralığı da ~6.25% genişlətməliyik */
        uint16_t x_range = raw_x_max - raw_x_min;
        uint16_t y_range = raw_y_max - raw_y_min;
        
        /* Kənar üçün əlavə (20 piksel = ~7% kənar) */
        uint16_t x_margin = x_range / 14;  /* ~7% */
        uint16_t y_margin = y_range / 11;  /* ~9% (20/220) */
        
        uint16_t new_x_min = (raw_x_min > x_margin) ? (raw_x_min - x_margin) : 50;
        uint16_t new_x_max = raw_x_max + x_margin;
        uint16_t new_y_min = (raw_y_min > y_margin) ? (raw_y_min - y_margin) : 50;
        uint16_t new_y_max = raw_y_max + y_margin;
        
        /* Limitlə */
        if (new_x_min < 50) new_x_min = 50;
        if (new_x_max > 4050) new_x_max = 4050;
        if (new_y_min < 50) new_y_min = 50;
        if (new_y_max > 4050) new_y_max = 4050;
        
        printf("Calculated calibration: X[%d-%d], Y[%d-%d]\r\n", 
               new_x_min, new_x_max, new_y_min, new_y_max);
        
        /* Kalibrasiya dəyərlərini təyin et */
        XPT2046_SetCalibration(new_x_min, new_x_max, new_y_min, new_y_max);
        
        /* Bütün 8 modu test et və ən yaxşısını tap */
        uint8_t best_mode = 0;
        int32_t best_total_error = 0x7FFFFFFF;
        
        printf("\nTesting all 8 coordinate modes:\r\n");
        
        for (uint8_t mode = 0; mode < 8; mode++) {
            XPT2046_SetCoordMode(mode);
            
            int32_t total_error = 0;
            
            /* Hər 4 nöqtəni test et */
            for (int p = 0; p < 4; p++) {
                uint16_t sx, sy;
                XPT2046_ConvertToScreen(cal_raw_x[p], cal_raw_y[p], &sx, &sy);
                
                int32_t ex = (int32_t)sx - (int32_t)cal_screen_x[p];
                int32_t ey = (int32_t)sy - (int32_t)cal_screen_y[p];
                total_error += (ex * ex + ey * ey);
            }
            
            printf("  Mode %d: total_error = %ld\r\n", mode, total_error);
            
            if (total_error < best_total_error) {
                best_total_error = total_error;
                best_mode = mode;
            }
        }
        
        XPT2046_SetCoordMode(best_mode);
        printf("\n==> BEST MODE: %d (total error = %ld)\r\n", best_mode, best_total_error);
        
        /* Nəticə ekranı */
        ILI9341_DrawString(20, 10, "4-POINT CALIBRATION OK!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
        
        char mode_str[32];
        sprintf(mode_str, "Best Mode: %d", best_mode);
        ILI9341_DrawString(80, 40, mode_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
        
        const char* mode_desc[] = {
            "Normal", "Swap+InvX", "InvBoth", "SwapOnly",
            "InvX", "InvY", "Swap+InvY", "Swap+InvBoth"
        };
        ILI9341_DrawString(80, 70, mode_desc[best_mode], ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        
        /* Test nəticələrini göstər */
        ILI9341_DrawString(10, 95, "Verification:", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        
